docs/notes/jwt.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JSON Web Tokens</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">JSON Web Tokens</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4ec055e">Example token</a></li>
<li><a href="#orga27041c">Three Parts</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org4ec055e" class="outline-2">
<h2 id="org4ec055e"><a href="#org4ec055e">Example token</a></h2>
<div class="outline-text-2" id="text-org4ec055e">
<pre class="example" id="org20aa4bb">
eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiaWF0IjoxNTE2MjM5MDIyfQ.SflKxwRJSMeKKF2QT4fwpMeJf36POk6yJV_adQssw5c
</pre>

<p>
Note tokens can be much different sizes depending on what algorithm is used.
</p>
</div>
</div>

<div id="outline-container-orga27041c" class="outline-2">
<h2 id="orga27041c"><a href="#orga27041c">Three Parts</a></h2>
<div class="outline-text-2" id="text-orga27041c">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">JWT</span> | cut -d <span style="color: #98be65;">"."</span> -f1
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9
</pre>


<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">JWT</span> | cut -d <span style="color: #98be65;">"."</span> -f2
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiaWF0IjoxNTE2MjM5MDIyfQ
</pre>


<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">JWT</span> | cut -d <span style="color: #98be65;">"."</span> -f3
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
SflKxwRJSMeKKF2QT4fwpMeJf36POk6yJV_adQssw5c
</pre>


<p>
All three parts are <a href="https://brockallen.com/2014/10/17/base64url-encoding/">base64url</a>-encoded (<a href="https://tools.ietf.org/html/rfc4648#section-5">rfc</a>). Neither <code>base64</code> nor <code>jq</code> fully
support base64url encoding, though it works sometimes. The first two parts are
JSON, the third is&#x2026;? The third part is a signature.
</p>

<p>
In the example token, the first part decodes properly, second part does not.
</p>

<p>
Works:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">JWT</span> | cut -d <span style="color: #98be65;">"."</span> -f1 | base64 --decode
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
{"alg":"HS256","typ":"JWT"}
</pre>


<p>
Does not completey work, missing last <code>}</code> character:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">JWT</span> | cut -d <span style="color: #98be65;">"."</span> -f2 | base64 --decode
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
{"sub":"1234567890","name":"John Doe","iat":1516239022
</pre>


<p>
More reliable decoding, using only jq:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">JWT</span> | jq -R <span style="color: #98be65;">'gsub("-";"+") | gsub("_";"/") | split(".") | .[1] | @base64d | fromjson'</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
{
  "sub": "1234567890",
  "name": "John Doe",
  "iat": 1516239022
}
</pre>
</div>
</div>
</div>
</body>
</html>
